clc
clear
close all

data = [ ...
0.5	 4719194.69	2187680.00	2525595.46 	5919.23 ;
0.6	 5224313.78	2187680.00	3030714.55 	5919.23 ;
0.7     5703477.68	3124950.00	2578397.46 	130.22 ;
0.8		6071820.17	3124950.00	2946739.95 	130.22 ;
0.9	 	6440162.67	3124950.00	3315082.45 	130.22 ;
1.0	 	6808505.16	3124950.00	3683424.94 	130.22 ;
1.1	 	7176847.65	3124950.00	4051767.43 	130.22 ;
1.2	 	7545190.15	3124950.00	4420109.93 	130.22 ;
1.3	 	7913532.64	3124950.00	4788452.42 	130.22 ;
1.4		8281875.13	3124950.00	5156794.91 	130.22 ;
1.5	 	8650217.63	3124950.00	5525137.41 	130.22 ;
1.6	 	9018560.12	3124950.00	5893479.90 	130.22 ;
1.7	 9360502.47	4319380.00	5040974.92 	147.55 ;
1.8	 9629435.45	5436860.00	4192288.53 	286.92 ;
1.9	9862340.37	5436860.00	4425193.45 	286.92 ;
2.0	 10095245.29	5436860.00	4658098.37 	286.92 ];

figure

plot(data(:,1), data(:,2),'-rx','LineWidth', 2, 'MarkerSize',10);
hold on

plot(data(:,1), data(:,3),'-o','LineWidth', 2, ...
    'Color', [10,79,162]/255, ...
    'MarkerFaceColor','none', ...
    'MarkerSize',8);
hold on

plot(data(:,1), data(:,4),'-^','LineWidth', 2, ...
    'Color',[110, 46, 128]/255,...
    'MarkerFaceColor','none', ...
    'MarkerSize',8);
hold on

plot(data(:,1), data(:,5),'-+','LineWidth', 2, ...
    'Color', [47, 102,27]/255, ...
    'MarkerFaceColor',[47, 102,27]/255, ...
    'MarkerSize',8);
hold on

xlabel('价格系数','FontName','Songti SC','FontSize',15)
ylabel('成本 (元)','FontName','Songti SC','FontSize',15,'rotation',90)

legend('总成本', '固定成本', '运输成本', '惩罚成本','FontName','Songti SC','Location','northwest','FontSize',12)
%, ...
     % [data(:,1), data(:,3)], 'LineWidth', 2, ...
     % [data(:,1), data(:,4)], 'LineWidth', 2, ...
     % [data(:,1), data(:,5)], 'LineWidth', 2);



% plot(x,y,'--gs',...
%     'LineWidth',2,...
%     'MarkerSize',10,...
%     'MarkerEdgeColor','b',...
%     'MarkerFaceColor',[0.5,0.5,0.5])
